---
kind: property
id: P:Autodesk.Revit.DB.Analysis.ConceptualConstructionType.MaterialId
source: html/84212ac3-afd4-e6a8-1a8e-9830d78da630.htm
---
# Autodesk.Revit.DB.Analysis.ConceptualConstructionType.MaterialId Property

Material used for visualization of this construction.

## Syntax (C#)
```csharp
public ElementId MaterialId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The input element materialId is not a material element.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null